tutorials/poiseuille flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       34160;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       34400;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       34640;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       35240;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       35840;
    }
)

// ************************************************************************* //
